Revit 2027 API
BuiltInFailures.SketchFailures.SculptingSingleLineLoopLiesOnAxis Property
 The highlighted lines lie on the axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SculptingSingleLineLoopLiesOnAxis { get; }
Public Shared ReadOnly Property SculptingSingleLineLoopLiesOnAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SculptingSingleLineLoopLiesOnAxis {
	FailureDefinitionId^ get ();
}
static member SculptingSingleLineLoopLiesOnAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace